load-testing/tweets.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 100
      name: "Warm up the application"
    - duration: 60
      arrivalRate: 100
      name: "Sustained light load"
    - duration: 30
      arrivalRate: 100
      rampTo: 500
      name: "Warm up to max load"
    - duration: 60
      arrivalRate: 500
      name: "Sustained max load"
  payload:
    path: "./csv/tweets.csv"
    fields:
      - "user_id"
      - "status"
      - "source"
scenarios:
  - name: "Write Tweet"
    flow:
      - post:
          url: "/tweets"
          json:
            user_id: '{{ user_id }}'
            status: '{{ status }}'
            source: '{{ source }}'